# Taps
tap "leecheneler/tomo"

# Core CLI tools
brew "git"        # Version control
brew "curl"       # HTTP requests
brew "jq"         # JSON processor
brew "mole"       # SSH tunnel manager

# Search & navigation
brew "ripgrep"    # Fast code search (rg)
brew "fd"         # Fast file finder
brew "fzf"        # Fuzzy finder
brew "bat"        # Better cat with syntax highlighting
brew "eza"        # Modern ls replacement
brew "tree"       # Directory structure display
brew "zoxide"     # Smarter cd

# Development
brew "mise"       # Polyglot runtime manager (Node, Deno, Python, etc.)
brew "rust"       # Rust programming language (rustc + cargo)
brew "gh"         # GitHub CLI
brew "opencode"   # Terminal-based AI coding assistant
brew "tomo"       # Task runner
brew "starship"   # Cross-shell prompt

# Document processing
brew "poppler"    # PDF rendering library (pdftotext, pdfinfo, etc.)

# Formatting & linting
brew "shfmt"      # Shell formatter
brew "shellcheck" # Shell script linter
brew "dprint"     # Markdown/JSON/YAML formatter
brew "lefthook"   # Git hooks manager
brew "cspell"     # Spell checker for code

# Fonts
cask "font-jetbrains-mono-nerd-font"  # Programming font with icons
cask "font-victor-mono"               # Elegant font with cursive italics
cask "font-monaspace"                 # GitHub's variable font family

# GUI Applications
cask "google-chrome"       # Browser
cask "visual-studio-code"  # Code editor
cask "docker-desktop"      # Containers
cask "kitty"               # Terminal emulator
cask "rectangle"           # Window management
cask "1password"           # Password manager
cask "1password-cli"       # 1Password CLI (op)
cask "slack"               # Team communication
cask "raycast"             # Launcher/productivity
cask "claude"              # Claude desktop app
cask "claude-code"         # Claude Code (agentic coding)
cask "superwhisper"        # Voice-to-text input